Конфигурация/src/Documents/ДокументТЗ/ДокументТЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДокументТЗ</name>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ЭтапыПроекта</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подрядчик</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Конфигурация/src/Catalogs/ЭтапыПроекта/ЭтапыПроекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭтапыПроекта</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Файл</name>
    <type>
      <types>CatalogRef.ЭтапыПроектаПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЭтапа</name>
    <type>
      <types>EnumRef.ТипЭтапа</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧДействия</name>
    <attributes>
      <name>ИмяДействия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбработчикДействия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеДействия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧТабличныеДанные</name>
    <attributes>
      <name>ИмяКолонки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеКолонки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧСтруктураКолонок</name>
    <attributes>
      <name>ИмяКолонки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипКолонки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Конфигурация/src/Documents/ДокументТЗ/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	лЗапрос = Новый Запрос;
	лЗапрос.текст= "
				   |Выбрать ссылка
				   |из справочник.ЭтапыПроекта
				   |Где Родитель.Наименование=""Шаблоны"" ";
	лВыборка=лЗапрос.Выполнить().Выбрать();

	Пока лВыборка.следующий() Цикл
		Элементы.ШаблонПроекта.СписокВыбора.Добавить(лВыборка.ссылка);
	КонецЦикла;
	
	//Счетчик=1;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ШаблонПроектаПриИзменении(Элемент)
	ШаблонПроектаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокВыбор(Элемент, Область, СтандартнаяОбработка)
	Если СтрНайти(Область.Имя, "Ссылка") Тогда

		лСсылка=ВернутьСсылкуЭлементаТабДок(ТабличныйДок.текущаяОбласть.Верх);
		ОткрытьФормупоСсылке(лСсылка);

	ИначеЕсли СтрНайти(Область.Имя, "Картинки") Тогда
		лСсылка=ВернутьСсылкуЭлементаТабДок(ТабличныйДок.текущаяОбласть.Верх);
		ОткрытьФормупоСсылке(лСсылка);
	ИначеЕсли СтрНайти(Область.Имя, "Кнопка") Тогда
		СтандартнаяОбработка=Ложь;
		лСодержимоеЯчейки=СтрРазделить(Область.Имя, "_");
		лКоманда=лСодержимоеЯчейки[0];
		лСсылка=ВернутьСсылкуЭлементаТабДок(ТабличныйДок.текущаяОбласть.Верх);
		Если лКоманда = "КнопкаУдалитьСтолбец" Тогда
			лДанные=лСодержимоеЯчейки[2];
		ИначеЕсли лКоманда = "КнопкаДобавитьСтолбец" Тогда
			лДанные=Новый структура("Заголовок,Значение");

			лДанные.Заголовок="НовыйСтолбец" + ПОлучитьСледующийНомер();
			лДанные.Значение=ПолучитьМассивЗаголовков_Сервер(лДанные.Заголовок, Число(лСодержимоеЯчейки[1]), лСсылка);
		ИначеЕсли лКоманда = "КнопкаДобавитьСтроку" Тогда
			лДанные="НовАяСтрока";
		ИначеЕсли лКоманда = "КнопкаУдалитьСтроку" Тогда
			лДанные=Число(лСодержимоеЯчейки[1]);
		КонецЕсли;
		Если Не лСсылка = Неопределено Тогда
			ВыполнитьДействиеНаСервере(лСсылка, лКоманда, лДанные);

		Иначе
			сообщить("Не найден этап проекта!");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормупоСсылке(пСсылка)
	лПараметрыФормы = Новый Структура("Ключ", пСсылка);
	лФорма = ПолучитьФорму("Справочник.ЭтапыПроекта.ФормаОбъекта", лПараметрыФормы);
	лФорма.подчиненныеЭлементы["ТабличныеЧасти"].Видимость=Ложь;
	лФорма.подчиненныеЭлементы["Текст"].Видимость=Ложь;
	лФорма.подчиненныеЭлементы["Родитель"].Видимость=Ложь;
	лФорма.подчиненныеЭлементы["Наименование"].Видимость=Ложь;
	лФорма.подчиненныеЭлементы["Верх"].Видимость=Ложь;
	лФорма.ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ПослеЗакрытияФормыВидео", ЭтотОбъект);
	лФорма.Открыть();
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивЗаголовков_Сервер(пИмяСтолбца, пНомерСтолбца, пСсылка)

	лЗапрос=Новый Запрос;
	лЗапрос.Текст= "Выбрать *
				   |из Справочник.ЭтапыПРоекта.тчСтруктураКолонок
				   |Где Ссылка=&ссылка
				   |Упорядочить по номерСтроки	 ";
	лЗапрос.УстановитьПараметр("ссылка", пСсылка);
	лРез=лЗапрос.Выполнить().Выгрузить();
	лМассив = Новый массив(лРез.Количество() + 1, 2);
	й=0;

	Для Каждого лСтрока Из лРез Цикл
		Если лСтрока.НомерСтроки = пНомерСтолбца Тогда

			лМассив[й][0]=(пИмяСтолбца);
			лМассив[й][1]=(типЗнч(пИмяСтолбца));
			й=й + 1;
			лМассив[й][0]=(лСтрока.ИмяКОлонки);
			лМассив[й][1]=(лСтрока.ТипКолонки);
		Иначе
			лМассив[й][0]=(лСтрока.ИмяКОлонки);
			лМассив[й][1]=(лСтрока.ТипКолонки);
		КонецЕсли;
		й=й + 1;

	КонецЦикла;

	Возврат ЛМассив;
КонецФункции

&НаСервере
Функция ПОлучитьСледующийНомер()
	гСчетчик=гСчетчик + 1;
	Возврат гСчетчик;
КонецФункции
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ПослеЗакрытияФормыВидео(Результат, ДополнительныеПараметры) Экспорт
	РазвернутьСправочникНаСервере();
КонецПроцедуры
&НаКлиенте
Процедура УровеньМинус(Команда)
	УровеньИзменить("-");
КонецПроцедуры

&НаКлиенте
Процедура УровеньПлюс(Команда)
	УровеньИзменить("+");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПодзадачу(Команда)
	ДобавитьОбластьТабДокНаСервере("Подзадача");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТаблицу(Команда)
	ДобавитьОбластьТабДокНаСервере("ЗаголовокТаблицы");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуТаблицы(Команда)
	ДобавитьОбластьТабДокНаСервере("СтрокаТаблицы");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТабличныйДокумент(Команда)
	ТабличныйДокументВывести();
КонецПроцедуры
&НаКлиенте
Процедура РазвернутьСправочник(Команда)

	РазвернутьСправочникНаСервере();
КонецПроцедуры

&НаКлиенте// Описание
Процедура ТабличныйДокПриИзмененииСодержимогоОбласти(Элемент, Область, ДополнительныеПараметры)
	//	Сообщить(Область.Имя + " содержит значение " + Область.значение);
	ПриИзмененииСодержимогоОбластиНаСервере(Область.Имя, Область.Значение, ТабличныйДок.текущаяОбласть.Верх);
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииСодержимогоОбластиНаСервере(пИмя, пЗначение, пСмещение)
	лСсылка=КакаяПодзадачаНаСервере(пСмещение);
	//лДанные=Новый Структура();
	лМассив=СтрРазделить(пИмя, "_");
	Если СтрНайти(пИмя, "Строка") <> 0 Тогда
		лДанные = Новый Структура("ИзменитьСтроку, Колонка, Номер", пЗначение, лМассив[2], Число(лМассив[1]));
	ИначеЕсли СтрНайти(пИмя, "Шапка") <> 0 Тогда
		лДанные = Новый Структура("ИзменитьКолонку, Было", пЗначение, лМассив[1]);
	ИначеЕсли СтрНайти(пИмя, "ТекстовоеПоле") <> 0 Тогда
		лДанные =  пЗначение;
	КонецЕсли;

	Если Не лСсылка = Неопределено Тогда
		Успех=Справочники.ЭтапыПроекта.ВыполнитьДействие(лСсылка, "ИзменитьДанные", лДанные);
	Иначе
		сообщить("Не найдет этап проекта!");
	КонецЕсли;

	Сообщить("Элемент " + лСсылка + Формат(Успех, "БЛ=' Не удалось записать'; БИ=' Записан удачно';"));
КонецПроцедуры

&НаСервере
Процедура ДобавитьТаблицуНаСервере()

	лОбъект=РеквизитФормыВЗначение("Объект");
	лМакет=лОБъект.ПолучитьМакет("Макет");
	лОбластьДанных=лМакет.ПолучитьОбласть("ЗаголовокТаблицы");

	ТабличныйДок.Вывести(лОбластьДанных);
КонецПроцедуры

&НаСервере
Процедура ОбработатьТ()
	Сообщить("!");
КонецПроцедуры

&НаКлиенте
Процедура ВставитьПодзадачу(Команда)

//	пСмещение=ТабличныйДок.текущаяОбласть.Верх;
//	R1=((пСмещение + 1));
//	C1=((1 + ТекущийУровень()));
//
//	R2=((пСмещение + 4));
//	C2=((3 + ТекущийУровень()));
//	мм=Новый массив;
//	//мм.Добавить(ТабличныйДок.Область(СтрСоединить(лМассивКоординат)));
//	мм.Добавить(ТабличныйДок.Область(R1, C1, R2, C2));
//	лОБластьВставки=мм;
//	Элементы.ТабличныйДок.УстановитьВыделенныеОбласти(лОБластьВставки);
	ВставитьОбластьТабДокНаСервере("Подзадача", , ТабличныйДок.текущаяОбласть.Верх);
	пСмещение=ТабличныйДок.текущаяОбласть.Верх;

КонецПроцедуры
&НаКлиенте
Процедура тест(Команда)
	ТестНаСервере(ТабличныйДок.текущаяОбласть.Верх);
КонецПроцедуры

&НаКлиенте
Процедура КакаяПодзадача(Команда)
	КакаяПодзадачаНаСервере(ТабличныйДок.текущаяОбласть.Верх);
КонецПроцедуры

&НаКлиенте
Процедура КопияЭлемента(Команда)
	КопияЭлементаСервер(ТабличныйДок.текущаяОбласть.Верх);

КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьДействиеНаСервере(лСсылка, лКоманда, лДанные)
	Успех=Справочники.ЭтапыПроекта.ВыполнитьДействие(лСсылка, лКоманда, лДанные);
	Если Успех Тогда
		РазвернутьСправочникНаСервере();
	КонецЕсли;
	//Сообщить("Элемент " + лСсылка + Формат(Успех, "БЛ=' Не удалось записать'; БИ=' Записан удачно';"));
КонецПроцедуры

&НаСервере
Процедура ШаблонПроектаПриИзмененииНаСервере()
	лОбъект=РеквизитФормыВЗначение("Объект");
	лДата=?(лОбъект.Дата = Дата(1, 1, 1), ТекущаяДата(), лОбъект.Дата);
	лГод=Формат(Год(лДата), "ЧГ=;");
	лНаименование=ПолучитьНаименованиеСледующий(ШаблонПроекта, лГод);
	лПроект=справочники.ЭтапыПроекта.КопироватьШаблонСправочника(ШаблонПроекта, лНаименование, лДата);
	Объект.Проект=лПроект;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНаименованиеСледующий(пСсылка, пГод)
	лГод=Справочники.ЭтапыПроекта.НайтиПоНаименованию(пГод, Истина, , );
	лЗапрос = Новый Запрос;
	лЗапрос.текст= "Выбрать первые 1
				   |наименование
				   |из справочник.ЭтапыПроекта
				   |где родитель в иерархии(&год)
				   |и родитель<>&год 
				   |и наименование подобно &Наименование
				   |Упорядочить по Наименование убыв
				   |";
	лЗапрос.Параметры.Вставить("год", лГод);
	лЗапрос.Параметры.Вставить("Наименование", "" + пСсылка.наименование + "%");
	лВыборка=лЗапрос.Выполнить().Выбрать();
	Если лВыборка.Следующий() Тогда
		лНовыйНомер=пСсылка.Наименование + Формат(Число(СтрЗаменить(лВыборка.Наименование, пСсылка.Наименование, ""))
			+ 1, "ЧЦ=3; ЧДЦ=0; ЧВН=;");
		Возврат лНовыйНомер;
	Иначе
		Возврат "" + пСсылка.Наименование + "001";
	КонецЕсли;
КонецФункции

&НаСервере
Процедура КопияЭлементаСервер(пВерх)
	лЭтап=ВернутьСсылкуЭлементаТабДок(пВерх);
	Справочники.ЭтапыПроекта.КопироватьЭлементСправочника(лЭтап);
КонецПроцедуры

&НаСервере
Функция КакаяПодзадачаНаСервере(пНомерСтроки)
	лТаблицаСоответствия=РеквизитФормыВЗначение("ТАблицаСоответствия");

	Для Каждого лОбласть Из ТабличныйДок.Области Цикл
		Если Найти(лОбласть.Имя, "Подзадача") > 0 Тогда
			лСмещение=0;
			Пока лОбласть.Верх + лСмещение <= лОбласть.низ Цикл
				нСтр=лТаблицаСоответствия.Добавить();
				нСтр.ИмяОбласти=лОбласть.Имя;
				нСтр.Строка=лОбласть.Верх + лСмещение;
				лСмещение=лСмещение + 1;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Сообщить(лТаблицаСоответствия.Количество());
	Сообщить(лТаблицаСоответствия.Найти(пНомерСтроки, "Строка").ИмяОбласти);
	лЭтап=Справочники.ЭтапыПроекта.НайтиПоКоду(Прав(лТаблицаСоответствия.Найти(пНомерСтроки, "Строка").ИмяОбласти, 9));
//	Сообщить(лЭтап);
	Возврат лЭтап;
КонецФункции

&НаСервере
Функция ВернутьСсылкуЭлементаТабДок(пНомерСтроки)
	лТаблицаСоответствия=РеквизитФормыВЗначение("ТАблицаСоответствия");

	Для Каждого лОбласть Из ТабличныйДок.Области Цикл
		Если Найти(лОбласть.Имя, "Подзадача") > 0 Тогда
			лСмещение=0;
			Пока лОбласть.Верх + лСмещение <= лОбласть.низ Цикл
				нСтр=лТаблицаСоответствия.Добавить();
				нСтр.ИмяОбласти=лОбласть.Имя;
				нСтр.Строка=лОбласть.Верх + лСмещение;
				лСмещение=лСмещение + 1;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;	
	//Сообщить(лТаблицаСоответствия.Количество());
	//Сообщить(лТаблицаСоответствия.Найти(пНомерСтроки,"Строка").ИмяОбласти);
	лЭтап=Справочники.ЭтапыПроекта.НайтиПоКоду(Прав(лТаблицаСоответствия.Найти(пНомерСтроки, "Строка").ИмяОбласти, 9));
	Возврат лЭтап;
КонецФункции
#КонецОбласти

#Область ОбработкаТабличногоДокумента
&НаСервере
Процедура ТабличныйДокументВывести()
	ТабличныйДок.Очистить();
	ПунктСписка="001";
	гСчетчик=1;
	лОбъект=РеквизитФормыВЗначение("Объект");
	лМакет=лОБъект.ПолучитьМакет("Макет");
	лОбластьДанных=лМакет.ПолучитьОбласть("Заголовок");
	//лОбластьДанных
	ТабличныйДок.Вывести(лОбластьДанных);
КонецПроцедуры
&НаСервере
Процедура ДобавитьОбластьТабДокНаСервере(пИмяОбласти, пИмяСправочника = "", пСсылка = Неопределено)
	Если пСсылка = Неопределено Тогда
		лОбъект=РеквизитФормыВЗначение("Объект");
		лМакет=лОБъект.ПолучитьМакет("Макет");
		лОбластьДанных=лМакет.ПолучитьОбласть(пИмяОбласти);
	Иначе
		лОбластьДанных=Справочники.ЭтапыПроекта.ПолучитьПечатнуюФорму(пСсылка);
		лОбластьДанных.Область(1, 1, лОбластьДанных.высотаТаблицы, лОбластьДанных.ШиринаТаблицы).имя=пИмяОбласти
			+ лОбластьДанных.Область(1, 1, лОбластьДанных.высотаТаблицы, лОбластьДанных.ШиринаТаблицы).имя;
		//лОбластьДанных.Имя=пИмяОбласти+пСсылка.Наименование;
	КонецЕсли;

	лДобавкаУровня=ПолучитьУровеньЗадачи();
	//вставка таблицы,текста,видео
	Если лОбластьДанных.Области.Найти("Шапка") <> Неопределено Тогда
		ДобавитьТаблицуЗначений(лОбластьДанных, пСсылка);
	КонецЕсли;
	Если лОбластьДанных.Области.Найти("СсылкаНаВидео") <> Неопределено Тогда
		лОбластьДанных.Области.Найти("СсылкаНаВидео").Значение=пСсылка.файл;

	КонецЕсли;
	Если лОбластьДанных.Области.Найти("ТекстовоеПоле") <> Неопределено Тогда
		лОбластьДанных.Области.Найти("ТекстовоеПоле").Значение=пСсылка.Текст;

	КонецЕсли;

	Если лОбластьДанных.Области.Найти("ПолеКартинки") <> Неопределено Тогда
		ДобавитьКартинку_сервер(лОбластьДанных, пСсылка);

	КонецЕсли;
	//------

	Для Каждого лобласть Из лОбластьДанных.Области Цикл
		Если ТипЗнч(лОбласть) <> Тип("РисунокТабличногоДокумента") Тогда
			лОбласть.Имя=лОбласть.Имя + "_" + ПунктСписка + пИмяСправочника;
		КонецЕсли;
	КонецЦикла;
	лОбластьДанных.Область("R1C1").Текст=ПунктСписка + пИмяСправочника;
	Если лДобавкаУровня Тогда
		ТабличныйДок.Присоединить(лОбластьДанных);
	Иначе
		ТабличныйДок.Вывести(лОбластьДанных);
	КонецЕсли;
	ОбновитьПунктСписка();
	//Счетчик=Счетчик + 1;
КонецПроцедуры

&НаСервере
Процедура ДобавитьКартинку_сервер(лОбластьДанных, пСсылка)

	лКартинка=Новый Картинка(РаботаСФайлами.ДвоичныеДанныеФайла(пСсылка.файл));
	лОбластьДанных.Области.ПолеКартинки.Картинка=лКартинка;
	//лОбластьДанных.Рисунки.Картинка.Расположить(лОбластьДанных.Область("ПолеКартинки"));
КонецПроцедуры

// Добавляет таблицу в область данных.
//
// Параметры:
//  лОбластьДанных -  Область данных, в которую добавляется таблица.
//  пСсылка - СправочникСсылка - Ссылка на элемент справочника, из которого добавляется таблица.
//
&НаСервере
Процедура ДобавитьТаблицуЗначений(пОбластьДанных, пСсылка)
	лМакет=РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");
	лТз=ПолучитьТаблицуЗначенийИзСправочника(пСсылка);
	лОблШ=лМакет.ПолучитьОбласть("шап");
	лОблС=лМакет.ПолучитьОбласть("стр");
	лОблНиз=лМакет.ПолучитьОбласть("низ");
	лОблЯчейка=лМакет.ПолучитьОбласть("Яч");

	лОбластьКолонка=пОбластьДанных.ПолучитьОбласть("Шапка");
	лОбластьСтрока=пОбластьДанных.ПолучитьОбласть("Строка");

	лСборнаяТаблица=Новый ТабличныйДокумент;
	лЗаголовок=Новый табличныйДокумент;
	лЗаголовок.Присоединить(лОблШ);
	лНомерВШапке=0;
	Для Каждого колонка Из лТз.Колонки Цикл

		лОбластьКолонка.Области[0].Значение=колонка.Имя;
		лОбластьКолонка.Области[0].Имя="Шапка_" + колонка.Имя;
		лЗаголовок.Присоединить(лОбластьКолонка);
		лНомерВШапке=лНомерВШапке + 1;
	КонецЦикла;
	
	лСборнаяТаблица.Вывести(лЗаголовок);
	лЧислоСтрок=лТз.Количество() * лОбластьСтрока.ВысотаТаблицы;
	лНомерВШапке=1;
	Для Каждого стр Из лТз Цикл
		лСтрока=Новый ТабличныйДокумент;
		Для Каждого лОбласть Из лОблС.Области Цикл
			Если Найти(лОбласть.Имя, "Добавить") > 0 Тогда
				лОбласть.Имя="КнопкаДобавитьСтроку_" + лНомерВШапке + "_";
			ИначеЕсли Найти(лОбласть.Имя, "Удалить") > 0 Тогда
				лОбласть.Имя="КнопкаУдалитьСтроку_" + лНомерВШапке + "_";
			КонецЕсли;
		КонецЦикла;
		лСтрока.Присоединить(лОблС);
		лНомерСтроки=0;
		Для Каждого колонка Из лТз.Колонки Цикл
			лОбластьСтрока.Области[0].Значение=стр[колонка.Имя];
			лОбластьСтрока.Области[0].Имя="Строка_" + лНомерВШапке + "_" + колонка.Имя;
			лСтрока.Присоединить(лОбластьСтрока);
			лНомерСтроки=лНомерСтроки + 1;
		КонецЦикла;
		лСборнаяТаблица.Вывести(лСтрока);
		лНомерВШапке=лНомерВШапке + 1;
	КонецЦикла;

	лСтрока=Новый ТабличныйДокумент;
	лСтрока.Присоединить(лОблЯчейка);
	лКолвоСтрок=лТз.КОличество();
	лНомерКолонки=1;
	Для Каждого колонка Из лТз.Колонки Цикл

		Для Каждого лОбласть Из лОблНиз.Области Цикл
			Если Найти(лОбласть.Имя, "Добавить") > 0 Тогда
				лОбласть.Имя="КнопкаДобавитьСтолбец_" + лНомерКолонки + "_" + колонка.Имя;
			ИначеЕсли Найти(лОбласть.Имя, "Удалить") > 0 Тогда
				лОбласть.Имя="КнопкаУдалитьСтолбец_" + лНомерКолонки + "_" + колонка.Имя;
			КонецЕсли;
		КонецЦикла;
		лНомерКолонки=лНомерКолонки + 1;

		лСтрока.Присоединить(лОблНиз);
	КонецЦикла;

	лСборнаяТаблица.Вывести(лСтрока);

	пОбластьДанных.УдалитьОбласть(пОбластьДанных.области["строка"], ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	пОбластьДанных.УдалитьОбласть(пОбластьДанных.области["Шапка"], ТипСмещенияТабличногоДокумента.ПоГоризонтали);

	х=0;
	Пока х < лЧислоСтрок Цикл
		пОбластьДанных.ВставитьОбласть(пОбластьДанных.Область("R8"), пОбластьДанных.Область("R8"),
			ТипСмещенияТабличногоДокумента.ПоВертикали);
		х=х + 1;
	КонецЦикла;

	пОбластьДанных.ВставитьОбласть(лСборнаяТаблица.Область(1, 1, лСборнаяТаблица.ВысотаТаблицы,
		лСборнаяТаблица.ШиринаТаблицы), пОбластьДанных.Область(3, 3, лСборнаяТаблица.ВысотаТаблицы + 3,
		лСборнаяТаблица.ШиринаТаблицы + 3), ТипСмещенияТабличногоДокумента.БезСмещения);
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуЗначенийИзСправочника(пСсылка)
	лТз=Новый ТаблицаЗначений;

	лЗапрос=Новый Запрос;
	лЗапрос.Текст= "Выбрать *
				   |из Справочник.ЭтапыПРоекта.тчСтруктураКолонок
				   |Где Ссылка=&ссылка
				   |Упорядочить по номерСтроки
				   |;
				   |Выбрать *
				   |из Справочник.ЭтапыПРоекта.тчТабличныеДанные
				   |Где Ссылка=&ссылка
				   |Упорядочить по номер";
	лЗапрос.УстановитьПараметр("ссылка", пСсылка);
	лРез=лЗапрос.ВыполнитьПакет();
	лВыгрузка1=лРез[0].Выгрузить();
	Для Каждого стр Из лВыгрузка1 Цикл
		лТз.Колонки.Добавить(стр.ИмяКолонки, Новый ОписаниеТипов(стр.ТипКолонки));
	КонецЦикла;

	лвыгрузка2=лРез[1].Выгрузить();
	Для Каждого колонка Из лТз.Колонки Цикл
		лВремТЗ=лТЗ.СкопироватьКолонки(колонка.имя);
		лМассив=лвыгрузка2.НайтиСтроки(Новый Структура("ИмяКОлонки", колонка.Имя));
		Для Каждого стр Из лМассив Цикл
			нстр=лВремТЗ.Добавить();
			нстр[0]=стр.ДанныеКолонки;
		КонецЦикла;
		Если лтЗ.Количество() = 0 Тогда
			Для Каждого стр Из лВремТЗ Цикл
				нстр=лтЗ.Добавить();
			КонецЦикла;
		КонецЕсли;
		лТз.ЗагрузитьКолонку(лВремТЗ.ВыгрузитьКолонку(колонка.имя), колонка);
	КонецЦикла;

	Возврат лТЗ;
КонецФункции
&НаСервере
Процедура ВставитьОбластьТабДокНаСервере(пИмяОбласти, пИмяСПР = "", пСмещение = 0)
	лОбъект=РеквизитФормыВЗначение("Объект");
	лМакет=лОБъект.ПолучитьМакет("Макет");
	//лДобавкаУровня=ПолучитьУровеньЗадачи();
	лОбластьДанных_=лМакет.ПолучитьОбласть(пИмяОбласти);
	Для Каждого лобласть Из лОбластьДанных_.Области Цикл
		лОбласть.Имя=лОбласть.Имя + "_" + ПунктСписка + пИмяСПР;
	КонецЦикла;
	лОбластьДанных_.Область("R1C1").Текст=ПунктСписка + пИмяСПР;
//	Если лДобавкаУровня тогда
//		ТабличныйДок.Присоединить(лОбластьДанных);
//	Иначе
//		ТабличныйДок.Вывести(лОбластьДанных);
//	КонецЕсли;
//	
	лВысота=лОбластьДанных_.высотаТаблицы;
	лШирина=лОбластьДанных_.ШиринаТаблицы;
	R1=((пСмещение + 1));
	C1=((1 + ТекущийУровень()));

	R2=((пСмещение + лВысота));
	C2=((лШирина + ТекущийУровень()));
	мм=Новый массив;
	//мм.Добавить(ТабличныйДок.Область(СтрСоединить(лМассивКоординат)));
	лОбластьВставки=ТабличныйДок.Область(R1, C1, R2, C2);
	лОбластьДанных=лОбластьДанных_.Область(1, 1, лВысота, лШирина);
	ТабличныйДок.ВставитьОбласть(лОбластьДанных, лОбластьВставки, ТипСмещенияТабличногоДокумента.ПоВертикали); 
	//ТабличныйДок.ВставитьОбласть(лОбластьДанных, ТабличныйДок.Область("C"+ТабличныйДок.текущаяОбласть.Верх+1));
	ОбновитьПунктСписка();
КонецПроцедуры
&НаСервере
Процедура ОбновитьПунктСписка()
	лНовыйУровень=Число(Прав(ПунктСписка, 3));
	лНовыйУровень=Формат(лНовыйУровень + 1, "ЧЦ=3; ЧДЦ=0; ЧВН=;");
	ПунктСписка=Лев(ПунктСписка, СтрДлина(ПунктСписка) - 3) + лНовыйУровень;
КонецПроцедуры

&НаСервере
Функция ПолучитьУровеньЗадачи()
	лУровень=Цел(СтрДлина(ПунктСписка) / 4);
	Если лУровень > 0 Тогда
		лОбъект=РеквизитФормыВЗначение("Объект");
		лМакет=лОБъект.ПолучитьМакет("Макет");
		S=1;
		лРезультат=лМакет.ПолучитьОбласть("Ячейка");
		ТабличныйДок.Вывести(лРезультат);
		Пока S < лУровень Цикл
			ТабличныйДок.Присоединить(лМакет.ПолучитьОбласть("Ячейка"));
			S=S + 1;
		КонецЦикла;
		Возврат Истина;
	Иначе
		Возврат Ложь;

	КонецЕсли;

КонецФункции

&НаСервере
Функция ТекущийУровень()
	Возврат Цел(СтрДлина(ПунктСписка) / 4);
КонецФункции

&НаСервере
Процедура ВывестиПодзадачу(пИмяПодзадачи)
	лОбъект=РеквизитФормыВЗначение("Объект");
	лМакет=лОБъект.ПолучитьМакет("Макет");
	лОбластьДанных=лМакет.ПолучитьОбласть("Подзадача");
	ТабличныйДок.Присоединить(лОбластьДанных);
КонецПроцедуры

&НаСервере
Процедура РазвернутьСправочникНаСервере()
	лЗапрос = Новый Запрос;
	лЗапрос.Текст =
	"ВЫБРАТЬ
	|	ЭтапыПроекта.Ссылка КАК Ссылка,
	|	ЭтапыПроекта.ВерсияДанных КАК ВерсияДанных,
	|	ЭтапыПроекта.ПометкаУдаления КАК ПометкаУдаления,
	|	ЭтапыПроекта.Родитель КАК Родитель,
	|	ЭтапыПроекта.Код КАК Код,
	|	ЭтапыПроекта.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ЭтапыПроекта КАК ЭтапыПроекта
	|	Где ссылка=(&Родитель)
	|	
	|Объединить все	
	|
	|ВЫБРАТЬ
	|	ЭтапыПроекта.Ссылка КАК Ссылка,
	|	ЭтапыПроекта.ВерсияДанных КАК ВерсияДанных,
	|	ЭтапыПроекта.ПометкаУдаления КАК ПометкаУдаления,
	|	ЭтапыПроекта.Родитель КАК Родитель,
	|	ЭтапыПроекта.Код КАК Код,
	|	ЭтапыПроекта.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ЭтапыПроекта КАК ЭтапыПроекта
	|	Где Родитель В Иерархии(&Родитель) и  не ПометкаУдаления
	|	
	|
	|	Упорядочить по код иерархия";

	лЗапрос.УстановитьПараметр("Родитель", Объект.Проект);
	лРезультат = лЗапрос.Выполнить().Выгрузить();

//лПредыдущий="";	
	лУровеньИерархии=Новый соответствие;
//лУровеньИерархии=Новый массив();
	Для Каждого лСтрока Из лРезультат Цикл
		Если лСтрока.Ссылка = Объект.Проект Тогда
			ТабличныйДокументВывести();
			лУровеньИерархии.Вставить(лСтрока.Ссылка, 0);
			лДобавочноеЧислоУровня=0;
			лПредыдущий=лСтрока;
		КонецЕсли;

		Если лСтрока.Родитель = лПредыдущий.Ссылка И лУровеньИерархии.Получить(лСтрока.Родитель) = 0 Тогда
			лНаименование=лСтрока.Наименование + лСтрока.Код;
			ДобавитьОбластьТабДокНаСервере("Подзадача", лНаименование, лСтрока.ссылка);
			лУровеньИерархии.Вставить(лСтрока.Ссылка, 1);
			лПредыдущий=лСтрока;
		ИначеЕсли лСтрока.Родитель = лПредыдущий.Родитель Тогда
			лНаименование=лСтрока.Наименование + лСтрока.Код;
			ДобавитьОбластьТабДокНаСервере("Подзадача", лНаименование, лСтрока.ссылка);
			лПредыдущий=лСтрока;
		ИначеЕсли лСтрока.Родитель = лПредыдущий.Ссылка Тогда
			лДобавочноеЧислоУровня=лДобавочноеЧислоУровня + 1;
			УровеньИзменить("+");
			лУровеньИерархии.Вставить(лСтрока.Ссылка, 1 + лДобавочноеЧислоУровня);
			лНаименование=лСтрока.Наименование + лСтрока.Код;
			ДобавитьОбластьТабДокНаСервере("Подзадача", лНаименование, лСтрока.ссылка);
			лПредыдущий=лСтрока;
		Иначе
			лСмещениеВлево=лДобавочноеЧислоУровня - лУровеньИерархии.Получить(лСтрока.Родитель);
			ж=0;
			Пока ж < лСмещениеВлево Цикл
				УровеньИзменить("-");
				ж=ж + 1;
			КонецЦикла;
			лНаименование=лСтрока.Наименование + лСтрока.Код;
			ДобавитьОбластьТабДокНаСервере("Подзадача", лНаименование, лСтрока.ссылка);
			лПредыдущий=лСтрока;
		КонецЕсли;

	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УровеньИзменить(пНаправление)
	Если пНаправление = "-" Тогда

		Если СтрДлина(ПунктСписка) > 4 Тогда
			лМассивУровней=СтрРазделить(ПунктСписка, ".");
			лМассивУровней.Удалить(лМассивУровней.Количество() - 1);
			ПунктСписка=СтрСоединить(лМассивУровней, ".");
			ОбновитьПунктСписка();
		КонецЕсли;
	ИначеЕсли пНаправление = "+" Тогда
		ПунктСписка=ПунктСписка + ".001";
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ТестНаСервере(пСмещение)
	лОбъект=РеквизитФормыВЗначение("Объект");
	лМакет=лОБъект.ПолучитьМакет("Макет");
	//лДобавкаУровня=ПолучитьУровеньЗадачи();
	лОбластьДанных=лМакет.Область("Подзадача");
	х=0;
	Пока х < 9 Цикл
		ТабличныйДок.ВставитьОбласть( ТабличныйДок.Область("R1000"), ТабличныйДок.Область("R" + пСмещение),
			ТипСмещенияТабличногоДокумента.ПоВертикали);
		х=х + 1;
	КонецЦикла;
	ТабличныйДок.ВставитьОбласть( лОбластьДанных, , ТипСмещенияТабличногоДокумента.ПоВертикали);
	РазвернутьСправочникНаСервере();
	х=0;
	Пока х < 1000 Цикл
		Генератор = Новый ГенераторСлучайныхЧисел;
		Число1 = Генератор.СлучайноеЧисло(1, 3);
		Если Число1 = 1 Тогда
			УровеньИзменить("+");
		ИначеЕсли Число1 = 2 Тогда
			ДобавитьОбластьТабДокНаСервере("Подзадача");
		ИначеЕсли Число1 = 3 Тогда
			УровеньИзменить("-");
		КонецЕсли;
		х=х + 1;
	КонецЦикла;

КонецПроцедуры
#КонецОбласти
